# CurrentMeasurement Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialFieldManager..::..CurrentMeasurement Property
SpatialFieldManager Class See Also
---
Stores the currently displayed measurement
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public int CurrentMeasurement { get; set; }
```

Visual Basic
---
```text
Public Property CurrentMeasurement As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int CurrentMeasurement {
	int get ();
	void set (int value);
}
```

# Remarks
Must be in the range from 0 to (numberOfMeasurements - 1)
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: measurement is not in the range from 0 to (number of measurements - 1) |

# See Also
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace